// Задание 1

// Необходимо с помощью цикла for вывести следующие 11 строк в консоль:
// 0 – это ноль
// 1 – нечетное число
// 2 – четное число
// 3 – нечетное число
// …
// 10 – четное число


// for (let i = 0; i <= 10; i++) {
//     const element = [i];
//     console.log(element);
// }

// Задание 2

// Дан массив [1, 2, 3, 4, 5, 6, 7]
// Сделайте из этого массива следующий [1, 2, 3, 6, 7]

// const cach = [1, 2, 3, 4, 5, 6, 7];
// const cachNew = cach.splice(3, 2);
// console.log(cach);

// Задание 3

// Создайте массив, состоящий из 5 произвольных значений, которые генерируются программой (диапазон значений от 0 до 10).
// Возведите каждый элемент этого массива в квадрат.

// const num = []
// for (let i = 1; i < 5; i++) {
//     num.push(Math.round(Math.random() * 10) ** 2);
// }

// console.log(num);



// Задание 4

// Создайте массив, состоящий из 5 элементов. (Элементами массива должны быть произвольные цифры в диапазоне от 0 до 10.)
// Удалите значение 3, если будет такое значение.
// Каждое значение исходного элемента массива необходимо увеличить на 10%.
// Выведите в консоль два этих массива.

// const num = []
// for (let i = 1; i < 5; i++) {
//     num.push(Math.round(Math.random() * 10));
// }

// console.log(num);


// Задание 5

// Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть
// выглядеть должно примерно так:

// for(…){/* здесь пусто */}


// Вместо многоточия нужно записать нужные разделы.
// Помните, что в первом, втором и третьем раздела цикла можно не только писать
// условия или увеличивать счетчик, в этих разделах допустимы любые выражения,
// например вызовы функций.