//Задание 1
// const tempCel = Number(prompt('Введите текущую температуру в градусах Цельсия'));
// const tempFar = Number((9 / 5) * tempCel + 32);


// alert(`Цельсий: ${tempCel}, Фаренгейт: ${tempFar}`);

//Задание 2
// const myName = 'Kirill';
// const admin = myName;

// console.log(admin)

//Задание 3
// console.log(10 + 10 + "10");// Ответ 2010, так как складывается два числа и приклеивается срока "10".
// console.log(10 + "10" + 10);// Ответ 101010, так как посередине стоит строка "10", к которой с обеих сторон приклеивается по числу 10.
// console.log(10 + 10 + +"10");// Ответ 30, так как строка "10" преобразуется в число с помощью знака (+).
// console.log(10 / -"");// Ответ -Infinity, так как при преобразовании "" с помощью знака (-) получаем -0, а при делении 10 на -0 получим -Infinity(бесконечность).
// console.log(10 / +"2,5");// Ответ NaN, так как +"2,5" не может быть преобразовано в число.
